tap "atlassian/acli"
tap "nikitabobko/tap"
tap "sst/tap"
brew "bat"
brew "docker"
brew "eza"
brew "node"
brew "firebase-cli"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "openjdk@21"
brew "python@3.13"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "uv"
brew "yazi"
brew "zoxide"
brew "atlassian/acli/acli"
brew "sst/tap/opencode"
cask "aerospace"
cask "aldente"
cask "bambu-studio"
cask "brave-browser"
cask "claude"
cask "claude-code"
cask "cursor"
cask "docker-desktop"
cask "firebase-admin"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "github@beta"
cask "google-chrome"
cask "hiddenbar"
cask "jetbrains-toolbox"
cask "keka"
cask "kiro"
cask "lm-studio"
cask "macfuse"
cask "obsidian"
cask "protonvpn"
cask "raycast"
cask "sketchup"
cask "stats"
cask "tailscale-app"
cask "texifier"
cask "thunderbird"
cask "todoist-app"
cask "transmission"
cask "veracrypt"
cask "virtualbox"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
cask "zerotier-one"
cask "zotero"
vscode "ajshortt.tokyo-hack"
vscode "alexcvzz.vscode-sqlite"
vscode "analytic-signal.preview-mp4"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "enkia.tokyo-night"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "illixion.vscode-vibrancy-continued"
vscode "ionutvmi.spacegray-vscode"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "james-yu.latex-workshop"
vscode "k--kato.intellij-idea-keybindings"
vscode "kevinrose.vsc-python-indent"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mvllow.rose-pine"
vscode "qwtel.sqlite-viewer"
vscode "redhat.java"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
